app/controllers/mangos_controller.rb

  def index
    @mangos = Mango.all
---
SELECT "mangos".* FROM "mangos"

  def create
    @mango = Mango.new(params_mango)
    if @mango.save
---
INSERT INTO "mangos" ("descricao", "valor", "banco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["descricao", "123"], ["valor", 123.0], ["banco", "123"], ["created_at", "2023-07-21 02:52:48.785191"], ["updated_at", "2023-07-21 02:52:48.785191"]]

  def update
    @mango = Mango.find(params[:id])
    if @mango.update(params_mango)
---
SELECT "mangos".* FROM "mangos" WHERE "mangos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mangos" SET "valor" = ?, "updated_at" = ? WHERE "mangos"."id" = ?  [["valor", 11.35], ["updated_at", "2023-07-21 15:15:24.762826"], ["id", 4]]

  def destroy
    @mango = Mango.find(params[:id])
    if @mango.destroy
---
SELECT "mangos".* FROM "mangos" WHERE "mangos"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "mangos" WHERE "mangos"."id" = ?  [["id", 14]]

  def set_mango
    @mango = Mango.find(params[:id])
---
SELECT "mangos".* FROM "mangos" WHERE "mangos"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]